# Load Verilog source files
read_verilog -sv ./rtl/Pipeline.sv

# (Optional) Specify the top module
hierarchy -top Pipeline

proc

# Generate JSON file for design
write_json ./synth/pipeline.json

# (Optional) Set synthesis directives or optimizations
# Example:
opt -fast
opt_clean

# Perform synthesis
synth -top Pipeline

# (Optional) Perform additional optimizations
# Example:
opt

# Write synthesized design to output file
write_verilog -noattr -noexpr ./synth/synth_pipeline.v
